/* Это объявление переменной, мы наши кнопку по тегу */
const button = document.querySelector('button');

/* Тут на кнопку навешиваем обрабочик, который ждёт клика и тогда запустит логику */
button.addEventListener('click', function() {
	alert('Я верю в силу знаний и постоянного саморазвития. Я ценю честность, ответственность и командную работу, понимая, что именно в сотрудничестве рождаются лучшие идеи. Мое кредо — быть не только специалистом, но и вдохновителем, открывающим новые горизонты для себя и других.')
})